Documents/ОплатаБанковскойКартой.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ОплатаБанковскойКартой</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.ЗаказДоговор</xr:Item>
				<xr:Item>Document.СчетНаОплату</xr:Item>
				<xr:Item>Document.РеализацияТоваровИУслуг</xr:Item>
				<xr:Item>Document.Монтаж</xr:Item>
				<xr:Item>Document.ОплатаБанковскойКартой</xr:Item>
				<xr:Item>Document.ВозвратТовараОтПокупателя</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УДАЛИТЬ_ВзаиморасчетыСКонтрагентамиПоЗаказДоговорам</xr:Item>
				<xr:Item>AccumulationRegister.УДАЛИТЬ_ОплатаПоСчетам</xr:Item>
				<xr:Item>AccumulationRegister.БонусыКонтрагентов</xr:Item>
				<xr:Item>AccumulationRegister.УДАЛИТЬ_ОплатаЗаказовНаПроизводство</xr:Item>
				<xr:Item>AccumulationRegister.ДолгиПоРассрочкам</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЭквайрингу</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЗаказам</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентамиВВалюте</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентамиПоЗаказам</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанкВозвращаетКомиссиюПриВозвратеОплаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийОплатаБанковскойКартой</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлатежнойКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПлатежныхКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДисконтныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодАвторизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комиссия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КредитныйДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КредитныеДоговоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачислятьБонусы</Name>
					<Comment>Служебный реквизит</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПлатежнойКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>22</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСменыККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧекаККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаВыполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентКомиссии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебныйУчетБонусовПоДисконтнымКартам</Name>
					<Comment>Служебный реквизит</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДоходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБонусовКНачислениюПоДисконтнойКарте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬДатаПлатежаПоРассрочке</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬОплатаПоРассрочке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬСчетНаОплату</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧекФискализирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭквайринговыйТерминал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭквайринговыеТерминалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументНАНБ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НастройкаАвтоматическихНачисленийБонусов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданПриИспользованииПодразделений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РаспределениеПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежаПоРассрочке</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВВалютеДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСекции</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Основания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВозвратПродукции</v8:Type>
								<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ОплатаБанковскойКартой</v8:Type>
								<v8:Type>cfg:DocumentRef.Замена</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаявкаНаДоставку</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратТовараОтПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыОперацийОплатаБанковскойКартой.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОперацийОплатаБанковскойКартой</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаБанковскойКартой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыКлиенту</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыОплатыККТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыОплатыККТ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
					<Comment>Оплата наличными средствами платежа</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Электронно</Name>
					<Comment>Оплата безналичными средствами платежа</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предоплата</Name>
					<Comment>Зачет аванса и/или предыдущих платежей</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Постоплата</Name>
					<Comment>Подлежит последующей уплате (в кредит) </Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВстречноеПредоставление</Name>
					<Comment>Подлежит уплате встречным предоставлением</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ОплатаБанковскойКартой/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПечатьЧека

// Возвращает предварительные параметры фискализации чека для документа.
//
// Параметры:
//   ДокументСсылка - ДокументСсылка.ПриходныйКассовыйОрдер - Документ.
//   ВерсияФФД - Строка - Версия ФФД.
//
// ВозвращаемоеЗначение:
//  Неопределено, Структура - см. функцию МенеджерОборудованияКлиентСервер.ПараметрыОперацииФискализацииЧека().
//
Функция ПараметрыОперацииФискализацииЧека(ДокументСсылка, ВерсияФФД = Неопределено, ЭкземплярПодключаемогоОборудования = Неопределено) Экспорт
	
	// Общие параметры чека
	ОбщиеПараметры = МенеджерОборудованияКлиентСервер.ПараметрыОперацииФискализацииЧека();
			
	// Общие реквизиты для всех типов оборудования.
	ПотолкиКассыОнлайн.ЗаполнитьОбщиеРеквизиты(ДокументСсылка, ОбщиеПараметры, ЭкземплярПодключаемогоОборудования);
			
	// Товарные позиции И Таблица оплат	
	Если ВерсияФФД = "1.0" Тогда
		ДополнитьТоварамиПараметрыПриПробитииЧека_1_0(ДокументСсылка, ОбщиеПараметры);
	Иначе
		Если ДокументСсылка.ВидОперации = Перечисления.ВидыОперацийОплатаБанковскойКартой.ВозвратОплатыКлиенту Тогда
			НомерСтрокиТовара = 0;
			МассивДокументовВозврата = Новый Массив;			
		    Для каждого СтрокаТЧ из ДокументСсылка.Основания Цикл
				Если ТипЗнч(СтрокаТЧ.Основание) = Тип("ДокументСсылка.ВозвратТовараОтПокупателя") Тогда
					МассивДокументовВозврата.Добавить(Новый Структура("Документ, СуммаДокумента, СуммаРаспределения", СтрокаТЧ.Основание, СтрокаТЧ.Основание.СуммаДокумента, СтрокаТЧ.Основание.СуммаДокумента));
				КонецЕсли;
			КонецЦикла;
			Если МассивДокументовВозврата.Количество() > 0 Тогда
				// возврат оплаты по документам Возврат от покупателя
				НомерСтрокиТовара = 0;
				ПризнакСпособаРасчета = Перечисления.ПризнакиСпособаРасчета.ОплатаКредита;
				ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ПлатежВыплата;
				ПотолкиКассыОнлайн.ДобавитьПозицииЧекаПоДокументамРасчетов(МассивДокументовВозврата, ОбщиеПараметры, НомерСтрокиТовара, ПризнакСпособаРасчета, ПризнакПредметаРасчета);			
				ПотолкиКассыОнлайн.ДобавитьСтрокуОплаты(ОбщиеПараметры, ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Электронно"), ДокументСсылка.Сумма); // #12169 исправление  
			Иначе
				// возврат оплаты - аванса
				// возврат оплаты по заказу (заказ - в ТЧ Распределение)
				// возврат оплаты по реализации (реализация - в ТЧ Распределение)
				ПотолкиКассыОнлайн.ДополнитьТоварамиПараметрыПриПробитииЧека(ДокументСсылка, ОбщиеПараметры);
			КонецЕсли;
		Иначе
			// поступление ДС
			ПотолкиКассыОнлайн.ДополнитьТоварамиПараметрыПриПробитииЧека(ДокументСсылка, ОбщиеПараметры);
		КонецЕсли;
	КонецЕсли;

	Возврат ОбщиеПараметры;
	
КонецФункции

#КонецОбласти

#Область ПечатьЧекаФФД_1_0

Процедура ДополнитьТоварамиПараметрыПриПробитииЧека_1_0(ДокументСсылка, ОбщиеПараметры)
	
	ТаблицаТоваров = ЗаполнитьТаблицуТоваровПоОснованию(ДокументСсылка);
	
	Для Каждого СтрокаТЧ Из ТаблицаТоваров Цикл
		//СтрокаПозицииЧека = Новый Структура();
		//СтрокаПозицииЧека.Вставить("ФискальнаяСтрока");
		СтрокаПозицииЧека = МенеджерОборудованияКлиентСервер.ПараметрыФискальнойСтрокиЧека();
		Если ПустаяСтрока(Строка(СтрокаТЧ.Номенклатура)) Тогда
			СтрокаПозицииЧека.Вставить("Наименование", "Предоплата");
		Иначе
			СтрокаПозицииЧека.Вставить("Наименование", Строка(СтрокаТЧ.Номенклатура));
		КонецЕсли;
		СтрокаПозицииЧека.Вставить("Количество"  , СтрокаТЧ.Количество);
		СтрокаПозицииЧека.Вставить("Цена"        , СтрокаТЧ.Цена);
		СтрокаПозицииЧека.Вставить("Сумма"       , СтрокаТЧ.Сумма);
		СтрокаПозицииЧека.Вставить("НомерСекции" , СтрокаТЧ.НомерСекции);
		СтрокаПозицииЧека.Вставить("СтавкаНДС"   , ВернутьСтавкуНДС(СтрокаТЧ.СтавкаНДС));
		ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);
	КонецЦикла;
	
	// Подготовка таблицы оплат
	СуммаВидаОплаты = ДокументСсылка.Сумма;	
	Если СуммаВидаОплаты <> 0 Тогда
		СтрокаОплаты = Новый Структура();
		//СтрокаОплаты.Вставить("ТипОплаты", 1);
		СтрокаОплаты.Вставить("ТипОплаты", ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Электронно"));
		СтрокаОплаты.Вставить("Наименование", "Платежная карта");
		СтрокаОплаты.Вставить("Сумма", СуммаВидаОплаты);
		ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
	КонецЕсли;
	
КонецПроцедуры

Функция ЗаполнитьТаблицуТоваровПоОснованию(ДокументСсылка) Экспорт
	
	ТаблицаТоваров = Новый ТаблицаЗначений;
	ТаблицаТоваров.Колонки.Добавить("Номенклатура");
	ТаблицаТоваров.Колонки.Добавить("Количество");
	ТаблицаТоваров.Колонки.Добавить("Цена");
	ТаблицаТоваров.Колонки.Добавить("Сумма");
	ТаблицаТоваров.Колонки.Добавить("НомерСекции");
	ТаблицаТоваров.Колонки.Добавить("СтавкаНДС");
	
	ДокументСсылкаОснование = Неопределено;
	Если ДокументСсылка.Основания.Количество() > 0 Тогда
		ДокументСсылкаОснование = ДокументСсылка.Основания[0].Основание;
	КонецЕсли;
	
	Если ЭтоПолнаяОплата(ДокументСсылка) Тогда
		//заполним табличную часть товаров (товары и услуги) по основанию
		Если ТипЗнч(ДокументСсылкаОснование) = Тип("ДокументСсылка.ЗаказДоговор") 
			или ТипЗнч(ДокументСсылкаОснование) = Тип("ДокументСсылка.Монтаж") 
			Тогда
			//ТоварыУслуги
			Для Каждого ТекущаяСтрока Из ДокументСсылкаОснование.ТоварыУслуги Цикл
				НоваяСтрока = ТаблицаТоваров.Добавить();
				НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
				НоваяСтрока.Количество = ТекущаяСтрока.Количество;
				НоваяСтрока.Цена = ТекущаяСтрока.Цена;
				НоваяСтрока.Сумма = ТекущаяСтрока.Сумма;
				НоваяСтрока.НомерСекции = ?(ЗначениеЗаполнено(ДокументСсылка.Касса), ДокументСсылка.Касса.СекцияПоУмолчанию, 1);
				НоваяСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
				//цену высчитаем из суммы, т.к. могли быьт скидки
				Если НЕ НоваяСтрока.Количество = 0 Тогда
					НоваяСтрока.Цена = Окр(НоваяСтрока.Сумма / НоваяСтрока.Количество,2);
				КонецЕсли;
			КонецЦикла;
			
		// Исключено в 2.0
		//ИначеЕсли ТипЗнч(ДокументСсылка.Основание) = Тип("ДокументСсылка.ЗаказНаПроизводство")  
		//	Тогда
		//	//продукция
		//	Если НЕ ДокументСсылка.Основание.ЗаказНаПродажу Тогда
		//		НоваяСтрока = ТаблицаТоваров.Добавить();
		//		НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
		//		НоваяСтрока.Количество = ДокументСсылка.Основание.ПродукцияКоличество;
		//		НоваяСтрока.Цена = ДокументСсылка.Основание.ПродукцияЦена;
		//		НоваяСтрока.Сумма = ДокументСсылка.Основание.ПродукцияСумма;
		//		НоваяСтрока.НомерСекции = ДокументСсылка.Касса.СекцияПоУмолчанию;
		//		НоваяСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
		//		//цену высчитаем из суммы, т.к. могли быьт скидки
		//		Если НЕ НоваяСтрока.Количество = 0 Тогда
		//			НоваяСтрока.Цена = Окр(НоваяСтрока.Сумма / НоваяСтрока.Количество,2);
		//		КонецЕсли;
		//	КонецЕсли;
		//	//товары
		//	Для Каждого ТекущаяСтрока Из ДокументСсылка.Основание.Товары Цикл
		//		НоваяСтрока = ТаблицаТоваров.Добавить();
		//		НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
		//		НоваяСтрока.Количество = ТекущаяСтрока.Количество;
		//		НоваяСтрока.Цена = ТекущаяСтрока.Цена;
		//		НоваяСтрока.Сумма = ТекущаяСтрока.Сумма;
		//		НоваяСтрока.НомерСекции = ДокументСсылка.Касса.СекцияПоУмолчанию;
		//		НоваяСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
		//		//цену высчитаем из суммы, т.к. могли быьт скидки
		//		Если НЕ НоваяСтрока.Количество = 0 Тогда
		//			НоваяСтрока.Цена = Окр(НоваяСтрока.Сумма / НоваяСтрока.Количество,2);
		//		КонецЕсли;
		//	КонецЦикла;
		//	//услуги
		//	Для Каждого ТекущаяСтрока Из ДокументСсылка.Основание.Услуги Цикл
		//		НоваяСтрока = ТаблицаТоваров.Добавить();
		//		НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
		//		НоваяСтрока.Количество = ТекущаяСтрока.Количество;
		//		НоваяСтрока.Цена = ТекущаяСтрока.Цена;
		//		НоваяСтрока.Сумма = ТекущаяСтрока.Сумма;
		//		НоваяСтрока.НомерСекции = ДокументСсылка.Касса.СекцияПоУмолчанию;
		//		НоваяСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
		//		//цену высчитаем из суммы, т.к. могли быьт скидки
		//		Если НЕ НоваяСтрока.Количество = 0 Тогда
		//			НоваяСтрока.Цена = Окр(НоваяСтрока.Сумма / НоваяСтрока.Количество,2);
		//		КонецЕсли;
		//	КонецЦикла;
		
		ИначеЕсли ТипЗнч(ДокументСсылкаОснование) = Тип("ДокументСсылка.РеализацияТоваровИУслуг")  
			или ТипЗнч(ДокументСсылкаОснование) = Тип("ДокументСсылка.СчетНаОплату")  
			Тогда
			//товары
			Для Каждого ТекущаяСтрока Из ДокументСсылкаОснование.Товары Цикл
				НоваяСтрока = ТаблицаТоваров.Добавить();
				НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
				НоваяСтрока.Количество = ТекущаяСтрока.Количество;
				НоваяСтрока.Цена = ТекущаяСтрока.Цена;
				НоваяСтрока.Сумма = ТекущаяСтрока.Сумма;
				НоваяСтрока.НомерСекции = ?(ЗначениеЗаполнено(ДокументСсылка.Касса), ДокументСсылка.Касса.СекцияПоУмолчанию, 1);
				НоваяСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
				//цену высчитаем из суммы, т.к. могли быть скидки
				Если НЕ НоваяСтрока.Количество = 0 Тогда
					НоваяСтрока.Цена = Окр(НоваяСтрока.Сумма / НоваяСтрока.Количество,2);
				КонецЕсли;
			КонецЦикла;
			//услуги
			Для Каждого ТекущаяСтрока Из ДокументСсылкаОснование.Услуги Цикл
				НоваяСтрока = ТаблицаТоваров.Добавить();
				НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
				НоваяСтрока.Количество = ТекущаяСтрока.Количество;
				НоваяСтрока.Цена = ТекущаяСтрока.Цена;
				НоваяСтрока.Сумма = ТекущаяСтрока.Сумма;
				НоваяСтрока.НомерСекции = ?(ЗначениеЗаполнено(ДокументСсылка.Касса), ДокументСсылка.Касса.СекцияПоУмолчанию, 1);
				НоваяСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
				//цену высчитаем из суммы, т.к. могли быьт скидки
				Если НЕ НоваяСтрока.Количество = 0 Тогда
					НоваяСтрока.Цена = Окр(НоваяСтрока.Сумма / НоваяСтрока.Количество,2);
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли ТипЗнч(ДокументСсылкаОснование) = Тип("ДокументСсылка.ЗаявкаНаДоставку")  
			Тогда
			//одна строка - доставка груза
			НоваяСтрока = ТаблицаТоваров.Добавить();
			НоваяСтрока.Количество = 1;
			НоваяСтрока.Цена = ДокументСсылка.Сумма;
			НоваяСтрока.Сумма = ДокументСсылка.Сумма;
			НоваяСтрока.НомерСекции = ?(ЗначениеЗаполнено(ДокументСсылка.Касса), ДокументСсылка.Касса.СекцияПоУмолчанию, 1);
			НоваяСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
		КонецЕсли;
	Иначе
		//укажем что это предоплата
		НоваяСтрока = ТаблицаТоваров.Добавить();
		НоваяСтрока.Количество = 1;
		НоваяСтрока.Цена = ДокументСсылка.Сумма;
		НоваяСтрока.Сумма = ДокументСсылка.Сумма;
		НоваяСтрока.НомерСекции = ?(ЗначениеЗаполнено(ДокументСсылка.Касса), ДокументСсылка.Касса.СекцияПоУмолчанию, 1);
		НоваяСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
	КонецЕсли;
	
	Возврат ТаблицаТоваров;
	
КонецФункции

Функция ЭтоПолнаяОплата(ДокументСсылка)
	
	Результат = Ложь;
	
	ДокументСсылкаОснование = Неопределено;
	Если ДокументСсылка.Основания.Количество() > 0 Тогда
		ДокументСсылкаОснование = ДокументСсылка.Основания[0].Основание;
	КонецЕсли;
	
	Если НЕ ДокументСсылкаОснование = Неопределено Тогда
		Если ТипЗнч(ДокументСсылкаОснование) = Тип("ДокументСсылка.ЗаявкаНаДоставку") Тогда
			Если ДокументСсылка.Сумма = ДокументСсылкаОснование.СтоимостьДоставки Тогда
				Результат = Истина;
			КонецЕсли;
		Иначе
			Если ДокументСсылка.Сумма = ДокументСсылкаОснование.СуммаДокумента Тогда
				Результат = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция преобразования значения реквизита СтавкаНДС к типу Число.
Функция ВернутьСтавкуНДС(СтавкаНДС)
	
	Если СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10") Тогда
		Ставка = 10;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18") Тогда
		Ставка = 18;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС0") Тогда
		Ставка = 0;
	Иначе
		Ставка = Неопределено;
	КонецЕсли;
	
	Возврат Ставка;
	
КонецФункции

#КонецОбласти

Функция ЗаголовокДокументаПоВидуОперации(Документ, НомерДокумента, ДатаДокумента, ВидОперации) Экспорт
	
	Заголовок = "";
	
	Если ВидОперации = Перечисления.ВидыОперацийОплатаБанковскойКартой.ОплатаБанковскойКартой Тогда
			Заголовок = ?(ЗначениеЗаполнено(Документ.Ссылка),
							НСтр("ru = 'Оплата банковской картой %1 от %2'"),
							НСтр("ru = 'Оплата банковской картой (создание)'"));

	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийОплатаБанковскойКартой.ВозвратОплатыКлиенту Тогда
			Заголовок = ?(ЗначениеЗаполнено(Документ.Ссылка),
							НСтр("ru = 'Оплата банковской картой (возврат) %1 от %2'"),
							НСтр("ru = 'Оплата банковской картой (возврат) (создание)'"));
							
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийОплатаБанковскойКартой.Кредит Тогда
			Заголовок = ?(ЗначениеЗаполнено(Документ.Ссылка),
							НСтр("ru = 'Оплата кредитом  %1 от %2'"),
							НСтр("ru = 'Оплата кредитом (создание)'"));
							
	КонецЕсли;
	
	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Заголовок, НомерДокумента, ДатаДокумента);
	
КонецФункции

#Область СозданиеНаОсновании

// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Документы.ОплатаБанковскойКартой.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании, Истина);
		
КонецПроцедуры

// Добавляет команду создания данного документа
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании, ЭтоВозврат = Ложь, Порядок = 0) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.ОплатаБанковскойКартой) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.ОплатаБанковскойКартой.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = Метаданные.Документы.ОплатаБанковскойКартой.Представление() + ?(ЭтоВозврат, " (возврат)", "");
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.Порядок = Порядок;
		
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

// Добавляет команду создания документа "Оплата банковской картой".
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОснованииМножественныйВыбор(КомандыСозданияНаОсновании) Экспорт
	Если ПравоДоступа("Добавление", Метаданные.Документы.ОплатаБанковскойКартой) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Обработчик = "СозданиеНаОснованииПотолкиКлиент.ОплатаБанковскойКартойСоздатьНаОснованииМножественныйВыбор";
		КомандаСоздатьНаОсновании.Представление = "Оплата банковской картой";
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.МножественныйВыбор = Истина;
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

Функция ДобавитьКомандуСоздатьНаОснованииОплатаКредитомМножественныйВыбор(КомандыСозданияНаОсновании) Экспорт
	Если ПравоДоступа("Добавление", Метаданные.Документы.ОплатаБанковскойКартой) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Обработчик = "СозданиеНаОснованииПотолкиКлиент.ОплатаКредитомСоздатьНаОснованииМножественныйВыбор";
		КомандаСоздатьНаОсновании.Представление = "Оплата кредитом";
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.МножественныйВыбор = Истина;
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

#КонецОбласти

#КонецЕсли
